app/controllers/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms"
---
  def index
    @chatrooms = Chatroom.all

INSERT INTO "chatrooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2017-07-05 10:21:56.201124"], ["updated_at", "2017-07-05 10:21:56.201124"]]
---
  def create
    @chatroom = Chatroom.new(chatroom_params)

    respond_to do |format|
      if @chatroom.save

DELETE FROM "chatrooms" WHERE "chatrooms"."id" = ?  [["id", 1]]
---
  def destroy
    @chatroom.destroy

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_chatroom
      @chatroom = Chatroom.find(params[:id])